app/controllers/school_classes_controller.rb

    def update
      @school_class = SchoolClass.find(params[:id])

      @school_class.update(title: params[:school_class][:title], room_number: params[:school_class][:room_number])
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "school_classes" SET "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["room_number", 14], ["updated_at", "2021-03-05 02:24:29.179682"], ["id", 1]]